#ifndef CONFIG_H_
#define CONFIG_H_

//************************ Тип конфигурации Rov *****************************//
// Simple Rov.
#define ROV_CONF_SIMPLE																
//************************ /Тип конфигурации Rov ****************************//

//********************** Тип конфигурации моторов ***************************//		
// 2 ходовых мотора, 1 на подъем, смещен к ходовым.
#define MOTOR_CONF_2FORWARD_1UP_DISPLACED
//********************** Тип конфигурации моторов ***************************//

//*************************** Настройки UART ********************************//
// Порт UART.
#define UART_PORT			0       

// Скорость порта UART.
#define UART_PORT_SPEED			115200UL											
//*************************** /Настройки UART *******************************//

//**************************** I2C скорость *********************************//
// I2C со скоростью 100kHz.
#define I2C_SPEED 100000L								
//**************************** /I2C скорость ********************************//

//******************************** Тесты ************************************//
// Отладка через UART.
//#define DEBUGGING_THROUGH_UART

// Отладка через LED.
//#define LED_DEBUG

// Тест скорости цикла.
//#define DEBUG_SPEED_CYCLE
//******************************** /Тесты ***********************************//

//************************ Настройки Debug UART *****************************//
#ifdef DEBUGGING_THROUGH_UART
  // Использование программной поддержки UART.
  #define UART_SOFTWARE_DEBUG
      
  // Скорость порта UART.
  #define UART_DEBUG_SPEED        9600UL // 115200UL 		
#endif				
//************************ /Настройки Debug UART ****************************//

#endif /* CONFIG_H_ */

